tap "homebrew/bundle"
tap "koekeishiya/formulae"
# Search tool like grep, but optimized for programmers
brew "ack"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Postgres C API library
brew "libpq"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# GNU debugger
brew "gdb"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Synchronize a maildir with an IMAP server
brew "isync"
# Language Server for the Lua language
brew "lua-language-server"
# Text-based web browser
brew "lynx"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# E-mail reader with support for Notmuch, NNTP and much more
brew "neomutt"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@20"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Simple and easy-to-use library to learn videogames programming
brew "raylib"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Implementation of the Language Server Protocol for LaTeX
brew "texlab"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Universal database tool and SQL client
cask "dbeaver-community"
cask "font-cousine-nerd-font"
cask "font-roboto-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
